---
type: NamingUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# NamingUtils

`Autodesk.Revit.DB.NamingUtils` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CompareNames | 2015 | `public static int CompareNames ( string nameA , string nameB )` |
| Method | IsValidName | 2015 | `public static bool IsValidName ( string string )` |